

#include <iostream>

int main()
{
    using namespace std;
    setlocale(0, "");
    int a = 1,
        a1 = 2,
        a2 = 3,
        a3 = 4,
        a4 = 5,
        a5 = 6,
        a6 = 7,
        a7 = 8,
        a8 = 9,
        a9 = 10;

    cout << "a = " << a << " | " << "размер: 4 байта" << endl;
    cout << "a1 = " << a1 << " | " << "размер: 4 байта" << endl;
    cout << "a2 = " << a2 << " | " << "размер: 4 байта" << endl;
    cout << "a3 = " << a3 << " | " << "размер: 4 байта" << endl;
    cout << "a4 = " << a4 << " | " << "размер: 4 байта" << endl;
    cout << "a5 = " << a5 << " | " << "размер: 4 байта" << endl;
    cout << "a6 = " << a6 << " | " << "размер: 4 байта" << endl;
    cout << "a7 = " << a7 << " | " << "размер: 4 байта" << endl;
    cout << "a8 = " << a8 << " | " << "размер: 4 байта" << endl;
    cout << "a9 = " << a9 << " | " << "размер: 4 байта" << endl;

    short b = 10,
          b1 = 11,
          b2 = 12,
          b3 = 13,
          b4 = 14,
          b5 = 15,
          b6 = 16,
          b7 = 17,
          b8 = 18,
          b9 = 19;

    cout << "b = " << b << " | " << "размер: 2 байта" << endl;
    cout << "b1 = " << b1 << " | " << "размер: 2 байта" << endl;
    cout << "b2 = " << b2 << " | " << "размер: 2 байта" << endl;
    cout << "b3 = " << b3 << " | " << "размер: 2 байта" << endl;
    cout << "b4 = " << b4 << " | " << "размер: 2 байта" << endl;
    cout << "b5 = " << b5 << " | " << "размер: 2 байта" << endl;
    cout << "b6 = " << b6 << " | " << "размер: 2 байта" << endl;
    cout << "b7 = " << b7 << " | " << "размер: 2 байта" << endl;
    cout << "b8 = " << b8 << " | " << "размер: 2 байта" << endl;
    cout << "b9 = " << b9 << " | " << "размер: 2 байта" << endl;

    long c = 20,
         c1 = 21,
         c2 = 22,
         c3 = 23,
         c4 = 24,
         c5 = 25,
         c6 = 26,
         c7 = 27,
         c8 = 28,
         c9 = 29;

    cout << "c = " << c << " | " << "размер: 4 байта" << endl;
    cout << "c1 = " << c1 << " | " << "размер: 4 байта" << endl;
    cout << "c2 = " << c2 << " | " << "размер: 4 байта" << endl;
    cout << "c3 = " << c3 << " | " << "размер: 4 байта" << endl;
    cout << "c4 = " << c4 << " | " << "размер: 4 байта" << endl;
    cout << "c5 = " << c5 << " | " << "размер: 4 байта" << endl;
    cout << "c6 = " << c6 << " | " << "размер: 4 байта" << endl;
    cout << "c7 = " << c7 << " | " << "размер: 4 байта" << endl;
    cout << "c8 = " << c8 << " | " << "размер: 4 байта" << endl;
    cout << "c9 = " << c9 << " | " << "размер: 4 байта" << endl;

    float d = 10.1,
          d1 = 11.1,
          d2 = 12.1,
          d3 = 13.1,
          d4 = 14.1,
          d5 = 15.1,
          d6 = 16.1,
          d7 = 17.1,
          d8 = 18.1,
          d9 = 19.1;

    cout << "d = " << d << " | " << "размер: 4 байта" << endl;
    cout << "d1 = " << d1 << " | " << "размер: 4 байта" << endl;
    cout << "d2 = " << d2 << " | " << "размер: 4 байта" << endl;
    cout << "d3 = " << d3 << " | " << "размер: 4 байта" << endl;
    cout << "d4 = " << d4 << " | " << "размер: 4 байта" << endl;
    cout << "d5 = " << d5 << " | " << "размер: 4 байта" << endl;
    cout << "d6 = " << d6 << " | " << "размер: 4 байта" << endl;
    cout << "d7 = " << d7 << " | " << "размер: 4 байта" << endl;
    cout << "d8 = " << d8 << " | " << "размер: 4 байта" << endl;
    cout << "d9 = " << d9 << " | " << "размер: 4 байта" << endl;

    double e = 10.11,
           e1 = 11.11,
           e2 = 12.11,
           e3 = 13.11,
           e4 = 14.11,
           e5 = 15.11,
           e6 = 16.11,
           e7 = 17.11,
           e8 = 18.11,
           e9 = 19.11;

    cout << "e = " << e << " | " << "размер: 8 байт" << endl;
    cout << "e1 = " << e1 << " | " << "размер: 8 байт" << endl;
    cout << "e2 = " << e2 << " | " << "размер: 8 байт" << endl;
    cout << "e3 = " << e3 << " | " << "размер: 8 байт" << endl;
    cout << "e4 = " << e4 << " | " << "размер: 8 байт" << endl;
    cout << "e5 = " << e5 << " | " << "размер: 8 байт" << endl;
    cout << "e6 = " << e6 << " | " << "размер: 8 байт" << endl;
    cout << "e7 = " << e7 << " | " << "размер: 8 байт" << endl;
    cout << "e8 = " << e8 << " | " << "размер: 8 байт" << endl;
    cout << "e9 = " << e9 << " | " << "размер: 8 байт" << endl;

    char f = '1',
         f1 = '2',
         f2 = '3',
         f3 = '4',
         f4 = '5',
         f5 = '6',
         f6 = '7',
         f7 = '8',
         f8 = '9',
         f9 = 'a';

    cout << "f = " << f << " | " << "размер: 1 байт" << endl;
    cout << "f1 = " << f1 << " | " << "размер: 1 байт" << endl;
    cout << "f2 = " << f2 << " | " << "размер: 1 байт" << endl;
    cout << "f3 = " << f3 << " | " << "размер: 1 байт" << endl;
    cout << "f4 = " << f4 << " | " << "размер: 1 байт" << endl;
    cout << "f5 = " << f5 << " | " << "размер: 1 байт" << endl;
    cout << "f6 = " << f6 << " | " << "размер: 1 байт" << endl;
    cout << "f7 = " << f7 << " | " << "размер: 1 байт" << endl;
    cout << "f8 = " << f8 << " | " << "размер: 1 байт" << endl;
    cout << "f9 = " << f9 << " | " << "размер: 1 байт" << endl;

    bool g = 1,
         g1 = 0,
         g2 = 1,
         g3 = 0,
         g4 = 1,
         g5 = 0,
         g6 = 1,
         g7 = 0,
         g8 = 1,
         g9 = 0;

         cout << "g = " << g << " | " << "размер: 1 байт" << endl;
         cout << "g = " << g1 << " | " << "размер: 1 байт" << endl;
         cout << "g = " << g2 << " | " << "размер: 1 байт" << endl;
         cout << "g = " << g3 << " | " << "размер: 1 байт" << endl;
         cout << "g = " << g4 << " | " << "размер: 1 байт" << endl;
         cout << "g = " << g5 << " | " << "размер: 1 байт" << endl;
         cout << "g = " << g6 << " | " << "размер: 1 байт" << endl;
         cout << "g = " << g7 << " | " << "размер: 1 байт" << endl;
         cout << "g = " << g8 << " | " << "размер: 1 байт" << endl;
         cout << "g = " << g9 << " | " << "размер: 1 байт" << endl;
}   

